Tekla.Structures.TeklaStructuresFiles.SessionLogFile
Gets the session history log file.

Tekla.Structures.TeklaStructuresFiles.LocateFile(System.Collections.Generic.List{System.String},System.String,System.String@)
This method locates a file in the specified search directories. The first found file will be returned.
If the file is not found in the search directories, it will return false and the out parameter will be empty.
searchDirectories: list of search directories
fileName: filename to search
absoluteFileName: output path if located
Returns: true if found, false if not